do


function run(msg, matches)

  return [[ 🌐 هزینه های خرید گروه با ربات پیشرفته 🌐


هزینه های خرید گروه یک : ⏬

1-گروه معمولی ماهیانه : 5 هزار تومان

2-گروه سوپرگروه ماهیانه : 7 هزار تومان

🚀🚀🚀🚀🚀🚀

هزینه های خرید گروه سالیانه : ⏬

1-گروه معمولی سالیانه : 10 هزار تومان

2-گروه سوپرگروه سالیانه : 15 هزار تومان

🚀🚀🚀🚀🚀🚀

هزینه های خرید گروه نامحدود،همیشگی : ⏬

1-گروه معمولی نامحدود : 15 هزار تومان

2- گروه سوپر گروه نامحدود : 20 هزار تومان

🚀🚀🚀🚀🚀🚀
جهت خرید گروه به آیدی زیر مراجعه کنید : ⏬

@kiava

در صورت ریپورت بودن به لینک زیر مراجعه کنید : ⏬

https://telegram.me/joinchat/CMaqeD8BCeHNenaYjXqBrg

کانال شرکت: @kiavaprotection

سایت شرکت: kiava.ir

🔥شرکت برنامه نویسی کیاوا🔥]]

end


return {

  description = "", 

  usage = "",

  patterns = {

    "^[/!#]nerkh$"

  }, 

  run = run 

}


end
